ErpTest/src/DataProcessors/пкПечатьСтикеровТехники/пкПечатьСтикеровТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкПечатьСтикеровТехники</name>
  <comment>Рарус</comment>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРемонта</name>
    <type>
      <types>EnumRef.пкМестоРемонта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланируемыеРаботы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СозданныеЗадания</name>
    <attributes>
      <name>ЗаданиеНаРемонт</name>
      <type>
        <types>DocumentRef.пкЗаданиеНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ErpTest/src/InformationRegisters/пкСостояниеТехники/пкСостояниеТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСостояниеТехники</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.пкПоказателиСостоянияТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пкПоказателиСостоянияТехники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСтатусыТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаЗавершения</name>
    <comment>Планируемая дата перехода в следующий статус (планируемая дата доставки, планируемая дата окончания ремонта)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыРемонтаТехники/пкСтатусыРемонтаТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыРемонтаТехники</name>
  <enumValues>
    <name>КРемонту</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкМестоРемонта/пкМестоРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкМестоРемонта</name>
  <enumValues>
    <name>УКлиента</name>
  </enumValues>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкЗаданиеНаРемонт/пкЗаданиеНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаРемонт</name>
  <registerRecords>AccumulationRegister.пкЗаданияНаРемонт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРемонта</name>
    <type>
      <types>EnumRef.пкМестоРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>пкПрикрепленыФайлыВДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланируемыеРаботы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/пкПогрузкаВыгрузкаПоДоставке/пкПогрузкаВыгрузкаПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкПогрузкаВыгрузкаПоДоставке</name>
  <comment>Погрузка/выгрузка техники по Доставке</comment>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <registerRecords>InformationRegister.пкСтатусыРемонтаТехники</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.пкОперацииПогрузкаВыгрузка</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательМП</name>
    <type>
      <types>CatalogRef.пкПользователиМП</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/ChartsOfCharacteristicTypes/пкПоказателиСостоянияТехники/пкПоказателиСостоянияТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>пкПоказателиСостоянияТехники</name>
  <type>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>String</types>
    <types>Number</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Местонахождения</name>
      <description>Местонахождения</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>Моточасы</name>
      <description>Моточасы</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ТемператураЗамерзанияОхлаждающейЖидкости</name>
      <description>Температура замерзания ох</description>
      <code>000000004</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ErpTest/src/DataProcessors/пкПечатьСтикеровТехники/Forms/Форма/Module.bsl
&НаКлиенте
Процедура МодельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Отбор = Новый Структура("пкЭтоТехника", Истина);
    
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
    
    //ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, , , , , Новый ОписаниеОповещения("МодельНачалоВыбораЗавершение", ЭтаФорма));
    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элемент, , , , );
    
КонецПроцедуры

&НаКлиенте
Процедура МодельНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
    
    Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
        Модель = ВыбранноеЗначение; 
        
        Если ЗначениеЗаполнено(Модель) Тогда
            ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
                СписокТехники, "Модель", Модель, , , Истина);
        Иначе
            ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
                СписокТехники, "Модель", , , , Ложь);
        КонецЕсли;        
    КонецЕсли;    
    
КонецПроцедуры  
    
&НаКлиенте
Процедура МодельПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(Модель) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Модель", Модель, , , Истина);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Модель", , , , Ложь);
    КонецЕсли;    
    
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
    
    Если ЗначениеЗаполнено(Подразделение) Тогда
		Если ТипЗнч(Подразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
			ОрганизацияИсточник = Подразделение.Владелец;
		Иначе
			ОрганизацияИсточник = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(ОрганизацияИсточник) Тогда
			Организация = ОрганизацияИсточник;
		КонецЕсли;
    КонецЕсли;    
        
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(Подразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Подразделение", Подразделение, , , Истина);
			
		ПодразделениеПриИзмененииНаСервере();
	Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Подразделение", , , , Ложь);
    КонецЕсли;    
        
КонецПроцедуры

&НаКлиенте
Процедура МестонахожденияПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(Местонахождения) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Местонахождения", Местонахождения, , , Истина);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Местонахождения", , , , Ложь);
    КонецЕсли; 
        
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусамТехникиПриИзменении(Элемент)
    
    УстановитьОтборПоСтатусамТехникиНаСервере();
        
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСтатусамТехникиНаСервере()
        
    Если ОтборПоСтатусамТехники = 0 Тогда
                
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", Перечисления.пкСтатусыТехники.НаБазе, , , Истина);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", , , , Ложь);
        
    ИначеЕсли ОтборПоСтатусамТехники = 1 Тогда
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", , , , Ложь);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", Перечисления.пкСтатусыРемонтаТехники.ВРемонте, , , Истина);

        
    ИначеЕсли ОтборПоСтатусамТехники = 2 Тогда
        
        СписокСтатусов = Новый СписокЗначений();

        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.ВПути);
        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.КОтгрузке);
        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.ВАренде);
        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.КВозврату);
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", СписокСтатусов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", , , , Ложь);
        
    Иначе
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", , , , Ложь);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", , , , Ложь);
            
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    УстановитьОтборПоСтатусамТехникиНаСервере();
    
    Подразделение = Пользователи.ТекущийПользователь().Подразделение;
    
    Если ЗначениеЗаполнено(Подразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Подразделение", Подразделение, , , Истина);
    КонецЕсли;        
	
//Рарус Владимир Подрезов 28.03.2017
	Если Объект.ПланируемыеРаботы.Количество() = 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		тРабота = Константы.пкРаботаНанесениеQRСтикера.Получить();
		УстановитьПривилегированныйРежим(Ложь);
		Если ЗначениеЗаполнено(тРабота) Тогда
			тОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.пкПечатьСтикеровТехники"));
			НоваяСтрока = тОбъект.ПланируемыеРаботы.Добавить();
			НоваяСтрока.Работа				= тРабота;
			НоваяСтрока.Количество			= 0.1;
			НоваяСтрока.ЕдиницаИзмерения	= НоваяСтрока.Работа.ЕдиницаИзмерения;
			ЗначениеВДанныеФормы(тОбъект, Объект);
		КонецЕсли;
	КонецЕсли;
	Если Объект.ПланируемыеРаботы.Количество() > 0 
		И Не ЗначениеЗаполнено(Объект.ПричинаОбращения) Тогда
		тРабота = Объект.ПланируемыеРаботы[0].Работа;
		Если ЗначениеЗаполнено(тРабота) Тогда
			Объект.ПричинаОбращения = ?(ЗначениеЗаполнено(тРабота.НаименованиеПолное), тРабота.НаименованиеПолное, тРабота.Наименование);
		КонецЕсли;
	КонецЕсли;
	Если Объект.ПланируемыеРаботы.Количество() > 0 
		И Не ЗначениеЗаполнено(Объект.ПричинаОбращения) Тогда
		тРабота = Объект.ПланируемыеРаботы.Работа;
		Если ЗначениеЗаполнено(тРабота) Тогда
			Объект.ПричинаОбращения = ?(ЗначениеЗаполнено(тРабота.НаименованиеПолное), тРабота.НаименованиеПолное, тРабота.Наименование);
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.МестоРемонта) Тогда
		Объект.МестоРемонта = Перечисления.пкМестоРемонта.НаБазе;
	КонецЕсли;
//Рарус Владимир Подрезов Конец
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	МакетПретензия=ПечатьЭтикетокСервер();
	уатОбщегоНазначенияТиповыеКлиент.уатНапечататьДокумент(МакетПретензия, 1, Ложь, "QR-стикеры техники ");
	//МакетПретензия.Показать();	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетокПоВыделенным(Команда)
	МассивТехники = Новый Массив;
	Для Каждого СтрокаВыделенная из Элементы.СписокТехники.ВыделенныеСтроки Цикл
		МассивТехники.Добавить(СтрокаВыделенная);	
	КонецЦикла;
	МакетПретензия=ПечатьЭтикетокСервер(МассивТехники);
	уатОбщегоНазначенияТиповыеКлиент.уатНапечататьДокумент(МакетПретензия, 1, Ложь, "QR-стикеры техники ");
КонецПроцедуры

&НаСервере
Функция ПечатьЭтикетокСервер(МассивТехники=Неопределено)
	Если МассивТехники=Неопределено Тогда
		МассивТехники=ПолучитьМассивТехники();
	КонецЕсли; 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТабличныйДокумент_ТехникаЭтикетки(ТабличныйДокумент,МассивТехники);
	
	Возврат ТабличныйДокумент;
КонецФункции

&НаСервере
Функция ПолучитьМассивТехники() Экспорт
    Схема = Элементы.СписокТехники.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.СписокТехники.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	//ЕстьСсылка=Ложь;
	//Для каждого ЭлементПоля из Настройки.УсловноеОформление.Элементы Цикл
	//	Если СтрНайти(Строка(Настройки.Условноеоформление.Элементы[0].Поля),"Ссылка")>0 Тогда
	//		ЕстьСсылка=Истина;	
	//	КонецЕсли;
	//КонецЦикла;	
	//Если не ЕстьСсылка Тогда
	//Элемент = Настройки.УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	//КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений ;
    ТЗ=Новый ТаблицаЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ); 
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	//СхемаДС=ЭтаФорма.СписокТехники.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	МассивТехники=ТЗ.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивТехники;
КонецФункции	

&НаКлиенте
Процедура СоздатьЗаданияНаРемонт(Команда)
	МассивТехники=ПолучитьМассивТехники();
	СоздатьЗаданияНаРемонтНаСервере(МассивТехники);
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданияНаРемонтНаСервере(МассивТехники)
	
	Для Каждого тТехника Из МассивТехники Цикл
		СоздатьДокументЗаданиеНаРемонт(тТехника);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданияНаРемонтПоВыделеннымСтрокам(Команда)
	МассивТехники = Новый Массив;
	Для Каждого СтрокаВыделенная из Элементы.СписокТехники.ВыделенныеСтроки Цикл
		МассивТехники.Добавить(СтрокаВыделенная);	
	КонецЦикла;
	СоздатьЗаданияНаРемонтНаСервере(МассивТехники);
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументЗаданиеНаРемонт(тТехника)
	
	НовоеЗадание = Документы.пкЗаданиеНаРемонт.СоздатьДокумент();
	//Если ТипЗнч(ЭтаФорма.Подразделение.Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
	//	НовоеЗадание.Организация = ЭтаФорма.Подразделение.Источник.Владелец;
	//Иначе
	//	НовоеЗадание.Организация = ЭтаФорма.Подразделение.Источник;
	//КонецЕсли;
	НовоеЗадание.Организация		= Организация;
	НовоеЗадание.Подразделение		= Подразделение;
	НовоеЗадание.ВидРемонта			= Объект.ВидРемонта;
	НовоеЗадание.Ответственный		= Пользователи.ТекущийПользователь();
	НовоеЗадание.Дата				= ТекущаяДата();
	НовоеЗадание.ОбъектЭксплуатации	= тТехника;
	//НовоеЗадание.ТребуемаяДата	= ТекущаяДата() + ?(ДнейДоТО < 0, 0, ДнейДоТО) * 24*60*60;
	НовоеЗадание.ПричинаОбращения	= Объект.ПричинаОбращения;
	НовоеЗадание.МестоРемонта		= Объект.МестоРемонта;
	
	НовоеЗадание.ПланируемыеРаботы.Загрузить(Объект.ПланируемыеРаботы.Выгрузить());
	
	МестоположениеТ = ПодобратьКлиентаПоМестоположению(НовоеЗадание.ОбъектЭксплуатации, ?(ЗначениеЗаполнено(НовоеЗадание.Дата), НовоеЗадание.Дата, ТекущаяДата()));
	Если МестоположениеТ <> Неопределено тогда
		ЗаполнитьЗначенияСвойств(НовоеЗадание, МестоположениеТ);
	КонецЕсли;
	Если ЗначениеЗаполнено(НовоеЗадание.Клиент) тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КонтактныеЛицаПартнеров.Ссылка,
		                      |	КонтактныеЛицаПартнеров.Владелец
		                      |ИЗ
		                      |	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		                      |ГДЕ
		                      |	КонтактныеЛицаПартнеров.Владелец = &Владелец
		                      |	И КонтактныеЛицаПартнеров.ПометкаУдаления = ЛОЖЬ");
		Запрос.УстановитьПараметр("Владелец", НовоеЗадание.Клиент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда 
			Выборка.Следующий();
			НовоеЗадание.КонтактноеЛицо	= Выборка.Ссылка;
		Иначе	
			НовоеЗадание.КонтактноеЛицо	= Неопределено;
		КонецЕсли;
		НовоеЗадание.Менеджер	= НовоеЗадание.Клиент.ОсновнойМенеджер;
	КонецЕсли;
	
	Попытка
		НовоеЗадание.Записать(РежимЗаписиДокумента.Запись);
		СтрокаЗадания = Объект.СозданныеЗадания.Добавить(); 
		СтрокаЗадания.ЗаданиеНаРемонт = НовоеЗадание.Ссылка;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось создать документ ""Задание на ремонт"" по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;	
	Попытка
		НовоеЗадание.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось провести документ " + НовоеЗадание.Ссылка + " по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПодобратьКлиентаПоМестоположению(тТехника, Период)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	пкСостояниеТехникиСрезПоследних.Значение КАК ОбъектСтроительства,
	                      |	ВЫБОР
	                      |		КОГДА пкСостояниеТехникиСрезПоследних.Регистратор ССЫЛКА Документ.пкПогрузкаВыгрузкаПоДоставке
	                      |			ТОГДА пкСостояниеТехникиСрезПоследних.Регистратор.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники.Партнер
	                      |		ИНАЧЕ пкСостояниеТехникиСрезПоследних.Значение.Заказчик.Партнер
	                      |	КОНЕЦ КАК Клиент
	                      |ИЗ
	                      |	РегистрСведений.пкСостояниеТехники.СрезПоследних(
	                      |			&Дата,
	                      |			Техника = &Техника
	                      |				И Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Местонахождения)) КАК пкСостояниеТехникиСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата, Техника = &Техника) КАК пкСтатусыТехникиСрезПоследних
	                      |		ПО пкСостояниеТехникиСрезПоследних.Техника = пкСтатусыТехникиСрезПоследних.Техника
	                      |ГДЕ
	                      |	пкСтатусыТехникиСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВАренде)");
	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.УстановитьПараметр("Техника", тТехника);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураВозврата = Новый Структура("Клиент,ОбъектСтроительства");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
		Возврат СтруктураВозврата;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПланируемыеРаботыРаботаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПланируемыеРаботы.ТекущиеДанные;
	
	ТекущаяСтрока.ЕдиницаИзмерения = ПолучитьЗначениеРеквизита(ТекущаяСтрока.Работа, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(ОбъектСсылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Процедура ТехникаПриИзменении(Элемент)
    Если Техника.Количество() > 0 Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Ссылка", Техника, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Ссылка", , , , Ложь);
    КонецЕсли;    
КонецПроцедуры
